{

  "lovable": {
    "title": "Against: Lovable / AI Code Gen Tools",
    "subtitle": "Expose the Total Cost of Ownership (TCO) of 'free' code by highlighting the hidden work in maintenance, security, and DevOps.",
    "tabs": [
      {
        "id": "key-differentiators",
        "title": "Key Differentiators",
        "description": null,
        "type": "simple",
        "content": [
          {
            "pointer": "Core Function & Setup",
            "painPoint": "Only generates code snippets. Requires a full dev environment setup before you can even start building the actual application.",
            "solution": "A complete, ready-to-use platform. Start building and shipping fully functional apps in minutes, not just code snippets."
          },
          {
            "pointer": "Backend & Enterprise Features",
            "painPoint": "No backend included. Critical features like SSO, RBAC, and database connections must be prompted, coded, and maintained from scratch.",
            "solution": "SSO, RBAC, and a library of secure data connectors are pre-packaged and ready to configure. Zero backend coding required."
          },
          {
            "pointer": "Deployment & DevOps",
            "painPoint": "Zero deployment capabilities. You are 100% responsible for setting up servers, CI/CD pipelines, and all ongoing DevOps.",
            "solution": "One-click publishing. We handle all the servers, scaling, and deployment infrastructure for you. No DevOps needed."
          },
          {
            "pointer": "Code Maintenance & Upkeep",
            "painPoint": "Total ownership burden. Every line of generated code becomes a long-term liability to debug, update, and manage.",
            "solution": "Zero code to maintain. The platform handles all underlying framework and package upgrades, eliminating technical debt."
          },
          {
            "pointer": "Security & Compliance",
            "painPoint": "High risk. AI-generated code must be manually audited for security vulnerabilities and potential open-source license infringements.",
            "solution": "Secure by design. Uses pre-vetted components and a secure middleware, minimizing risk and compliance overhead."
          }
        ]
      }
    ]
  },
  
  "django": {
    "title": "Against: Django",
    "subtitle": "Not a complete box — Django leaves you coding UI, connectors, and infra. DronaHQ gives you enterprise guardrails and 1-click deploy, making it ~32x faster to ship apps to end-users.",
  "tabs": [
      {
        "id": "key-differentiators",
        "title": "Key Differentiators",
        "description": null,
        "type": "simple",
        "content": [
           {
            "pointer": "Core Function",
            "painPoint": "A backend **framework** only. Requires you to build custom front-ends, connectors, and hosting from scratch.",
            "solution": "A complete **development platform**. Provides a unified solution for UI, backend, and deployment out-of-the-box."
          },
          {
            "pointer": "UI",
            "painPoint": "Rigid, outdated admin UI. Customization is heavy developer work.",
            "solution": "Modern drag-and-drop UI builder. Build polished interfaces in minutes."
          },
          {
            "pointer": "Data Connectors",
            "painPoint": "Tied to a **single database**. Connecting to APIs or other sources requires custom code.",
            "solution": "**Dozens of pre-built connectors.** Connect to any data source in minutes, no code needed."
          },
          {
            "pointer": "Components",
            "painPoint": "No real components, just HTML templates. Table features like search/sort require full-stack coding.",
            "solution": "Rich, pre-built components. Tables have search, sort, and pagination built-in."
          },
          {
            "pointer": "Framework & Package Upkeep",
            "painPoint": "Constant work to upgrade Django and manage/secure dozens of PyPI packages. Risk of \"dependency hell.\"",
            "solution": "**Zero upkeep for you.** We manage all frameworks, packages, and dependencies. You get an always-updated platform."
          },
          {
            "pointer": "Hosting & Infra",
            "painPoint": "**Self-hosted and self-managed.** They are responsible for all servers, databases, security patches, and DevOps.",
            "solution": "**Fully hosted and managed.** We handle all infrastructure, security, and scalability. Zero DevOps for you."
          }
        ]
      }
    ]
  },
  "php": {
    "title": "Against: PHP / Laravel",
    "subtitle": "Highlight the security risks, maintenance burden, and fragmentation of the PHP ecosystem.",
    "tabs": [
      {
        "id": "key-differentiators",
        "title": "Key Differentiators",
        "description": null,
        "type": "simple",
        "content": [
          {
            "pointer": "UI",
            "painPoint": "Inconsistent UI across different third-party admin packages. All customization requires a PHP developer.",
            "solution": "**One unified, modern UI builder.** Creates a consistent, high-quality user experience for all tools."
          },
          {
            "pointer": "Data Connectors",
            "painPoint": "Built for a single database. External connections are manual coding projects.",
            "solution": "**Language-agnostic connectors.** Stop writing boilerplate API code; start using your data now."
          },
          {
            "pointer": "Components",
            "painPoint": "Limited by the chosen admin package. Missing components require major custom development.",
            "solution": "**Vast component library.** Get powerful building blocks like charts, modals, and forms instantly."
          },
          {
            "pointer": "Framework & Package Upkeep",
            "painPoint": "Requires managing both PHP and framework versions. Heavy reliance on Composer packages that need constant updates.",
            "solution": "**Zero upkeep for you.** We manage all frameworks, packages, and dependencies. You get an always-updated platform."
          },
          {
            "pointer": "Hosting & Infra",
            "painPoint": "**High maintenance burden.** They manage complex LAMP/LEMP stacks. Older versions like PHP are **EOL** and a critical security risk.",
            "solution": "**Always secure, always updated.** We eliminate the risk and overhead of server management and security patching."
          }
        ]
      }
    ]
  },
  "react": {
    "title": "vs React + Node.js",
    "subtitle": "Frame their \"total control\" as an extreme and unnecessary cost for internal tools, and sell them on \"Time-to-Value.\"",
    "tabs": [
      {
        "id": "key-differentiators",
        "title": "Key Differentiators",
        "description": null,
        "type": "simple",
        "content": [
          {
            "pointer": "UI",
            "painPoint": "**Maximum cost for custom UI.** Every element is built from scratch by expensive developers. Very slow to build and change.",
            "solution": "**Speed and flexibility.** Drag-and-drop a beautiful UI in seconds, with powerful customization when needed."
          },
          {
            "pointer": "Data Connectors",
            "painPoint": "Every API connection is a manual Node.js coding project, handling auth, errors, and logic from scratch.",
            "solution": "**Configuration, not code.** Our pre-built connectors handle the boilerplate, saving hundreds of hours."
          },
          {
            "pointer": "Components",
            "painPoint": "**They build their own components.** They spend weeks of developer time building a table that we give you in one click.",
            "solution": "**Enterprise-grade component library on Day 1.** We've already built and perfected the tools you need."
          },
          {
            "pointer": "Framework & Package Upkeep",
            "painPoint": "**Highest upkeep burden.** Constant updates in the JS ecosystem. Managing hundreds of `npm` packages is a major risk and time sink.",
            "solution": "**Zero upkeep for you.** We manage all frameworks, packages, and dependencies. You get an always-updated platform."
          },
          {
            "pointer": "Hosting & Infra",
            "painPoint": "**Highest complexity and cost.** Requires managing separate front-end/back-end deployments, CI/CD pipelines, and DevOps staff.",
            "solution": "**Unified and simple.** A single platform for your UI and logic. We handle all deployments and infrastructure."
          }
        ]
      }
    ]
  },
  "retool": {
    "title": "Vs Retool",
    "subtitle": "Position DronaHQ as the more accessible, scalable, and commercially friendly platform.",
    "tabs": [
      {
        "id": "tech-diff",
        "title": "Technical Differentiators",
        "description": null,
        "type": "retool",
        "content": [
          {
            "feature": "Logic Building",
            "dronaHq": "Visual, block-based \"Action Flow\" builder, promoting a no-code/low-code approach.",
            "retool": "Code-centric, primarily relying on JavaScript in event handlers and transformers."
          },
          {
            "feature": "Multipage State",
            "dronaHq": "Seamless and native data sharing between pages, reducing development overhead.",
            "retool": "Requires manual state management using Temporary State or URL Parameters."
          },
          {
            "feature": "Builder Environment",
            "dronaHq": "A single, unified builder for creating both web and native mobile applications.",
            "retool": "Separate builders and environments for web and mobile applications."
          },
          {
            "feature": "UI/UX Components",
            "dronaHq": "Built-in support for advanced UI like popups, modals, and slide-out drawers.",
            "retool": "Often requires custom components or CSS/JS workarounds for complex UI patterns."
          },
          {
            "feature": "AI Assistance",
            "dronaHq": "Integrated AI CoPilot for generating UI, queries, and logic from prompts.",
            "retool": "AI features focused on query generation and code completion."
          }
        ]
      },
      {
        "id": "commercial-diff",
        "title": "Commercial Differentiators",
        "description": "DronaHQ's commercial model makes enterprise-grade features accessible on lower-tier plans.",
        "type": "retool",
        "content": [
          {
            "feature": "Single Sign-On (SSO)",
            "dronaHq": "Available on the **Business** plan.",
            "retool": "Generally reserved for the **Enterprise** plan."
          },
          {
            "feature": "Localization",
            "dronaHq": "Included in **all plans**.",
            "retool": "Reserved for the **Enterprise** plan."
          },
          {
            "feature": "Advanced Theming",
            "dronaHq": "Included in **all plans**.",
            "retool": "Full control is reserved for the **Enterprise** plan."
          }
        ]
      },
      {
        "id": "support-diff",
        "title": "Support & Onboarding",
        "description": "The approach to developer enablement and support highlights a key strategic difference.",
        "type": "retool",
        "content": [
          {
            "feature": "Developer Onboarding",
            "dronaHq": "Accelerates developer productivity with a **\"Ramping up Devs\"** model, offering 24x7 expert assistance to reduce the learning curve.",
            "retool": "Onboarding is primarily self-serve, relying on documentation, community forums, and traditional tiered support for troubleshooting."
          }
        ]
      }
    ]
  },
  "appsmith": {
    "title": "Vs Appsmith",
    "subtitle": "Position DronaHQ as the comprehensive, enterprise-ready platform for both web and native mobile apps.",
    "tabs": [
      {
        "id": "tech-diff",
        "title": "Technical Differentiators",
        "description": null,
        "type": "retool",
        "content": [
          {
            "feature": "Platform Focus",
            "dronaHq": "A single, unified builder for creating both responsive **web and native mobile** applications simultaneously.",
            "appsmith": "**Web apps only.** Primarily focused on building internal tools and admin panels for desktop browsers."
          },
          {
            "feature": "Logic Building",
            "dronaHq": "Visual, block-based **\"Action Flow\"** builder that allows for complex, multi-step logic without extensive coding.",
            "appsmith": "**Code-centric.** Relies heavily on writing JavaScript in queries and event handlers to manage application logic."
          },
          {
            "feature": "UI Components",
            "dronaHq": "**Over 150+ components**, including advanced controls like document viewers, signature pads, and native mobile elements.",
            "appsmith": "Provides a solid library of standard web widgets. Lacks advanced or mobile-specific components."
          },
          {
            "feature": "Backend Connectors",
            "dronaHq": "Exhaustive library including **gRPC, SOAP**, and more ready 3rd party APIs like Stripe and Zendesk.",
            "appsmith": "Good core support for REST, GraphQL, and major databases. Lacks gRPC and has a smaller library of ready APIs."
          },
          {
            "feature": "AI Assistance",
            "dronaHq": "Integrated AI CoPilot for generating UI from designs (**Vision AI**), creating queries, and building logic flows from text.",
            "appsmith": "AI features are primarily focused on generating database queries and code within the editor."
          }
        ]
      },
      {
        "id": "commercial-diff",
        "title": "Commercial & Strategic Differentiators",
        "description": "Highlighting the differences in business model, support, and enterprise readiness.",
        "type": "retool",
        "content": [
          {
            "feature": "Source Model",
            "dronaHq": "A **commercial, proprietary platform** offering dedicated enterprise support and a managed environment.",
            "appsmith": "**Open-source core.** Provides transparency and flexibility, but requires more self-management and relies on community support."
          },
          {
            "feature": "Enterprise Readiness",
            "dronaHq": "Key features like **SSO and custom domains** are available on more accessible Business plans.",
            "appsmith": "Many critical enterprise features are gated and reserved for the highest-tier **Enterprise plan**."
          },
          {
            "feature": "Developer Onboarding",
            "dronaHq": "Offers **hands-on engineering support** and co-building sessions to accelerate developer onboarding.",
            "appsmith": "Primarily **self-serve and community-driven**, with dedicated support available at the enterprise level."
          }
        ]
      }
    ]
  }
}
